Repository: IFXGlam/IFX
Catalog: locale/*/LC_MESSAGES/django.po
Languages: he

source: English
he: אנגלית

source: Hebrew
he: עברית

source: Contact
he: צרו קשר

source: Pel: 02-5654332
he: טלפון : 02-5654332

source: Email: rusom@jer-cin.org.il
he: דוא"ל : rusom@jer-cin.org.il

source: Address
he: מיקום

source: 11 Hebron rd. POB 8651 <br> Jerusalem, 9108402
he: דרך חברון 11, ת.ד. 8561 ירושלים, 9108402

source: Enter Site
he: לאתר

source: Jerusalem Cinematheque
he: סינמטק ירושלים

source: Search Archive
he: חיפוש בארכיון

source: Collections
he: אוספים

source: About Archive
he: אודות הארכיון

source: Conservation and Restoration
he: שימור ורסטורציה

source: Depositing Materials
he: הפקדת חומרים

source: Jerusalem Cinematheque Site
he: לאתר סינמטק ירושלים

source: Jerusalem
he: ירושלים

source: Heb
he: Eng

source: Search All
he: חיפוש חופשי

source: Movie's Name
he: שם סרט

source: Year/s
he: שנה/ים

source: Director's Name
he: במאי/ת

source: Search...
he: חיפוש...

source: The Israeli Film Archive
he: הארכיון הישראלי לסרטים

source: The Nathan Axelrod Newsreel Collection
he: אוסף יומני נתן אקסלר

source: Watch more
he: לעיון באוסף
